import React from 'react';
import './PrivacyPloicy.css'; 
import DiyarahLogo from '/icons/MallStackTitledCleared.png'

import Header from '../../components/Layout/Header'
import HeroSection from '../../components/Other/HeroSection';
import Footer from '../../components/Layout/Footer';
import Up from '../../components/Other/Up';

const PrivacyPolicy = () => {
  return (
    <>
      <div className='overlay-image'></div>
      <Header />
      <HeroSection />
      <Up />
      <div className="privacy-policy-container">
        <header>
          <h1 className="privacy-policy-title">سياسة الخصوصية لشركة ديارة العقارية</h1>
        </header>

        <section>
          <p className="privacy-policy-text">
            نرحب بكم في شركة ديارة العقارية، حيث نهتم بحماية خصوصيتكم ونسعى لتوفير تجربة آمنة أثناء تفاعلكم مع خدماتنا. تهدف هذه الوثيقة إلى توضيح كيفية جمعنا واستخدامنا للمعلومات الشخصية وكيف نحمي هذه المعلومات.
          </p>
        </section>

        <section>
          <h2>1. جمع المعلومات</h2>
          <p>نقوم بجمع بيانات محددة لتقديم خدماتنا بشكل فعال. يتم ذلك من خلال نماذج التسجيل، ونماذج الاتصال، ونماذج حجز الوحدات السكنية. نحن نسعى جاهدين لضمان دقة واكتمال المعلومات التي نجمعها.</p>
        </section>

        <section>
          <h2>2. استخدام المعلومات</h2>
          <p>نستخدم المعلومات لتحسين جودة خدماتنا وتلبية احتياجاتكم. نرسل أحدث الأخبار والتحديثات عبر النشرات الإخبارية لمشتركينا، ونستخدم بيانات الاتصال للرد على استفساراتكم وتلبية طلبات الخدمة.</p>
        </section>

        <section>
          <h2>3. حماية البيانات</h2>
          <p>نلتزم بحماية بياناتكم وسرية معلوماتكم الشخصية. نتخذ إجراءات أمان فعّالة للوقاية من فقدان البيانات أو الوصول غير المصرح به.</p>
        </section>

        <section>
          <h2>4. مشاركة المعلومات</h2>
          <p>نحن لا نشارك معلوماتكم الشخصية مع أي طرف خارجي بدون موافقتكم الصريحة، إلا إذا كانت هناك حاجة قانونية لذلك.</p>
        </section>

        <section>
          <h2>5. الامتثال للقوانين</h2>
          <p>نلتزم بالامتثال للقوانين والتشريعات المعمول بها فيما يتعلق بحماية البيانات وحقوق الخصوصية.</p>
        </section>
        
        <section>
          <h2>6. حقوق العملاء</h2>
          <p>نقدم لعملائنا حق الوصول والتصحيح والتحكم في معلوماتهم الشخصية. يمكنكم سحب موافقتكم في أي وقت.</p>
        </section>

        <section>
          <h2>7. تحديثات السياسة</h2>
          <p>نستخدم المعلومات لتحسين جودة خدماتنا وتلبية احتياجاتكم. نحتفظ بحق تحديث سياسة الخصوصية، وسنقوم بإشعاركم بأي تغييرات قد تؤثر على حقوقكم.</p>
        </section>

        <section>
          <h2>8. التعامل مع المعلومات الائتمانية</h2>
          <p>عند طلب معلومات ائتمانية، سنقدم لكم سياسة الائتمان للتعريف بكيفية التعامل مع هذه المعلومات وكيفية الحفاظ على سريتها.</p>
        </section>

        <section>
          <h2>9. استفسارات</h2>
          <p>لأي استفسار أو توضيح حول سياسة الخصوصية، يرجى الاتصال بفريق خدمة العملاء لدينا.</p>
        </section>

        <section>
          <h2>10. شكرًا لثقتكم</h2>
          <p>نشكركم على ثقتكم في شركة ديارة العقارية. نحن نعمل جاهدين لتقديم خدمات عالية الجودة مع احترام تام لخصوصيتكم وحقوقكم.</p>
        </section>
        <div id='plogoDiv'>
          <img src={DiyarahLogo} alt="Company Logo" className="plogo" loading="lazy" />
        </div>
      </div>
      <Footer />
    </>
  );
};

export default PrivacyPolicy;
